{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 128], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "convolution_1", "class_name": "Conv1D", "config": {"name": "convolution_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["convolution_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling1d_1", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"name": "convolution_2", "class_name": "Conv1D", "config": {"name": "convolution_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["convolution_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"name": "convolution_3", "class_name": "Conv1D", "config": {"name": "convolution_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["convolution_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling1d_3", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": null, "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "output_merged", "class_name": "Lambda", "config": {"name": "output_merged", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPoOdHJhaW5fbW9kZWwucHnaCDxsYW1iZGE+MAAAAPMAAAAA\n", null, null], "module": "tensorflow.python.keras.layers.core", "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxYAAAB8AGQBGQBmAXwAZAJkAIUCGQAXAFMAKQNO6QAAAADp\nAgAAAKkAKQHaBXNoYXBlcgMAAAByAwAAAHoOdHJhaW5fbW9kZWwucHnaCDxsYW1iZGE+MQAAAPMA\nAAAA\n", null, null], "output_shape_type": "lambda", "output_shape_module": "tensorflow.python.keras.layers.core", "arguments": {}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "output_realtime", "class_name": "Activation", "config": {"name": "output_realtime", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["output_merged", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output_realtime", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0001250000059371814, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "convolution_1/kernel", "shape": [5, 128, 256], "dtype": "float32"}, {"name": "convolution_1/bias", "shape": [256], "dtype": "float32"}, {"name": "convolution_2/kernel", "shape": [5, 256, 256], "dtype": "float32"}, {"name": "convolution_2/bias", "shape": [256], "dtype": "float32"}, {"name": "convolution_3/kernel", "shape": [5, 256, 256], "dtype": "float32"}, {"name": "convolution_3/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [256, 10], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [10], "dtype": "float32"}]}]}